[
    {
      "id": 1,
      "title": "Getting Started with Investing",
      "summary": "Learn the fundamentals of investing and how to navigate the application.",
      "prologue": "This guide covers the basics you need to know before making your first investment. We'll walk through setting up your account, understanding different investment vehicles, and how to use all features of our platform effectively.",
      "content": "# Getting Started with Investing\n\n## What is investing?\nInvesting is simply putting your money to work so it can grow over time. When you invest, you buy things like stocks, bonds, or funds that can increase in value.\n\n## Why should I invest?\n- Your money can grow more than in a savings account\n- It helps fight inflation (rising prices)\n- It can help you reach big goals like retirement\n\n## Steps to get started:\n\n### 1. Decide how much to invest\n- Start with an amount you're comfortable with\n- Consider setting up automatic deposits\n- Remember: only invest money you won't need soon\n\n### 2. Choose your first investments\n- For beginners, index funds are a great place to start\n- Consider a \"total market\" fund that includes many companies\n- Our app recommends starter portfolios based on your goals\n\n### 3. Track your progress\n- Check the \"Portfolio\" section to see how your investments are doing\n- Don't panic about short-term ups and downs\n- Focus on your long-term goals\n\n## Investment types for beginners:\n\n**Stocks**: Buying a small piece of a company. When the company does well, your stock usually increases in value.\n\n**Bonds**: Lending money to companies or governments who pay you interest. Generally less risky than stocks.\n\n**Funds**: Collections of many stocks or bonds. These help spread your risk across many investments.\n\n**Remember:** Investing always involves some risk, but historically, the stock market has grown over the long term."
    },
    {
      "id": 2,
      "title": "Investment Glossary for Beginners",
      "summary": "A comprehensive glossary defining key financial terms every investor should know.",
      "prologue": "From 'Asset Allocation' to 'Yield', this guide explains financial terminology in plain language. Understanding these terms will help you make sense of investment news and make more informed decisions.",
      "content": "# Investment Glossary for Beginners\n\n## Common Investment Terms Made Simple\n\n**Asset**: Anything of value that you own.\n\n**Asset Allocation**: How you divide your money between different types of investments (like stocks, bonds, and cash).\n\n**Bear Market**: When the market drops by 20% or more from its high point.\n\n**Bull Market**: When the market rises steadily for an extended period.\n\n**Bonds**: Loans you make to a company or government, who promises to pay you back with interest.\n\n**Broker**: A person or company that buys and sells investments for you.\n\n**Capital Gain**: The profit when you sell an investment for more than you paid.\n\n**Compound Interest**: When you earn interest on both your original investment and on the interest you've already earned.\n\n**Dividend**: Money a company pays to shareholders, usually from profits.\n\n**Diversification**: Spreading your investments across different types to reduce risk.\n\n**ETF (Exchange-Traded Fund)**: A fund that trades like a stock but contains many different investments.\n\n**Index Fund**: A fund that tries to match the performance of a market index (like the S&P 500).\n\n**Inflation**: The rising cost of goods and services over time.\n\n**Mutual Fund**: A professionally managed fund that pools money from many investors.\n\n**Portfolio**: All of your investments combined.\n\n**Risk Tolerance**: How comfortable you are with the possibility of losing money.\n\n**Stock**: A small piece of ownership in a company.\n\n**Volatility**: How quickly and how much an investment's price changes.\n\n**Yield**: The income return on an investment, shown as a percentage."
    },
    {
      "id": 3,
      "title": "Understanding Price-to-Earnings (P/E) Ratio",
      "summary": "Learn how to use P/E ratios to evaluate stock valuations and make informed decisions.",
      "prologue": "The P/E ratio compares a company's stock price to its earnings per share. Trailing P/E uses past performance, while forward P/E uses projected earnings. Lower P/E may indicate undervalued stocks, while higher P/E might suggest growth expectations.",
      "content": "# Understanding Price-to-Earnings (P/E) Ratio\n\n## What is the P/E ratio?\nThe Price-to-Earnings ratio is one of the most common ways to determine if a stock is expensive or cheap. It compares a company's share price to how much profit it earns per share.\n\n## How to calculate P/E ratio\nP/E ratio = Stock Price ÷ Earnings Per Share\n\n**Example:** If a stock costs $50 and the company earns $2 per share, the P/E ratio is 25 ($50 ÷ $2 = 25)\n\n## What P/E ratio tells you\n- **Lower P/E** (below 15): Might be undervalued or have problems\n- **Average P/E** (15-25): Fairly valued compared to the market\n- **Higher P/E** (above 25): Could be overvalued or expected to grow quickly\n\n## Two types of P/E ratio\n\n### Trailing P/E\n- Uses earnings from the past 12 months\n- Based on actual results, not predictions\n- More reliable but doesn't account for future growth\n\n### Forward P/E\n- Uses predicted earnings for the next 12 months\n- Helps consider future potential\n- Less reliable because it's based on estimates\n\n## How to use P/E ratio as a beginner\n\n1. **Compare to the same industry**: A tech company might have a higher P/E than a utility company, and that's normal\n\n2. **Look at the trend**: Is the P/E getting higher or lower over time?\n\n3. **Check the company's growth**: A high P/E might be justified if the company is growing quickly\n\n**Remember:** P/E ratio is just one tool. Don't make investment decisions based on this number alone."
    },
    {
      "id": 4,
      "title": "Earnings Per Share (EPS) Explained",
      "summary": "Discover how EPS can help you identify profitable companies.",
      "prologue": "EPS represents a company's profit divided by outstanding shares. Higher EPS generally indicates better profitability. Watching EPS growth trends over time can help identify companies that are consistently improving their financial performance.",
      "content": "# Earnings Per Share (EPS) Explained\n\n## What is EPS?\nEarnings Per Share (EPS) shows how much profit a company makes for each share of its stock. It's one of the most important numbers to look at when evaluating a company.\n\n## How to calculate EPS\nEPS = (Net Income - Dividends on Preferred Stock) ÷ Average Outstanding Common Shares\n\n**Example:** If a company earns $100 million, has no preferred stock, and has 50 million shares, the EPS is $2 ($100 million ÷ 50 million = $2)\n\n## Why EPS matters to investors\n- Helps compare profitability between companies\n- Shows if a company is making money or losing money\n- Rising EPS over time usually indicates a growing company\n\n## Different types of EPS\n\n### Basic EPS\n- The standard calculation shown above\n- Easiest to understand and most commonly referenced\n\n### Diluted EPS\n- Accounts for things that could create more shares in the future (like stock options)\n- Always lower than basic EPS\n- More conservative and usually the better number to look at\n\n## How to use EPS as a beginner\n\n1. **Look for positive EPS**: Companies with positive EPS are making money\n\n2. **Compare EPS growth**: Look for companies that increase their EPS year after year\n\n3. **Check EPS surprises**: When companies report earnings higher than experts predicted, their stock price often rises\n\n**Remember:** A single EPS number doesn't tell the whole story. Look at EPS trends over several quarters or years to get a better picture of a company's health."
    },
    {
      "id": 5,
      "title": "Market Capitalization: Size Matters",
      "summary": "Understand what market cap tells you about a company and its risks.",
      "prologue": "Market cap (stock price × outstanding shares) categorizes companies as small, mid, or large-cap. Large-caps typically offer stability but slower growth, while small-caps offer higher growth potential with increased volatility.",
      "content": "# Market Capitalization: Size Matters\n\n## What is market capitalization?\nMarket capitalization (or \"market cap\") is the total value of all a company's shares. It tells you the size of a company in the stock market.\n\n## How to calculate market cap\nMarket Cap = Current Share Price × Total Number of Outstanding Shares\n\n**Example:** If a company has 10 million shares and each share costs $50, the market cap is $500 million ($50 × 10 million = $500 million)\n\n## Market cap categories\n\n### Large-cap ($10+ billion)\n- Examples: Apple, Microsoft, Amazon\n- More stable and established\n- Often pay dividends\n- Lower growth potential but less risky\n\n### Mid-cap ($2-10 billion)\n- Examples: Etsy, DocuSign, Mattel\n- Balance of growth and stability\n- Often growing faster than large companies\n- Moderate risk level\n\n### Small-cap ($300 million-$2 billion)\n- Examples: Smaller retailers, regional banks\n- Higher growth potential\n- More volatile (prices move up and down more)\n- Higher risk but possible higher rewards\n\n### Micro-cap (below $300 million)\n- Very small companies\n- Highest risk category\n- Can grow very quickly or fail completely\n- Not recommended for beginners\n\n## Why market cap matters to investors\n\n1. **Risk assessment**: Larger companies are generally less risky\n\n2. **Diversification**: A balanced portfolio might include companies of different sizes\n\n3. **Growth expectations**: Smaller companies have more room to grow\n\n**Remember:** A company's market cap doesn't tell you if its stock is a good value. Many large companies continue to grow well, and many small companies never succeed."
    },
    {
      "id": 6,
      "title": "Diversification Strategies",
      "summary": "Protect your portfolio by spreading risk across different assets.",
      "prologue": "Diversification means investing across various asset classes, industries, and geographies to reduce risk. This guide explains how proper diversification can help weather market volatility while maintaining growth potential.",
      "content": "# Diversification Strategies\n\n## What is diversification?\nDiversification means spreading your money across different investments instead of putting it all in one place. It's the investment version of \"don't put all your eggs in one basket.\"\n\n## Why diversify?\n- Reduces your overall investment risk\n- Helps protect against big losses\n- Can provide more stable returns over time\n- Allows you to capture growth in different areas\n\n## Simple ways to diversify as a beginner\n\n### 1. Mix different investment types\n- **Stocks**: For growth potential\n- **Bonds**: For stability and income\n- **Cash**: For emergencies and short-term needs\n\nA simple beginning mix might be:\n- 60% stocks for growth\n- 30% bonds for stability\n- 10% cash for security\n\n### 2. Diversify across industries\nInvest in companies from different sectors like:\n- Technology\n- Healthcare\n- Financial services\n- Consumer goods\n- Energy\n\n### 3. Include different company sizes\n- Large companies (more stable)\n- Medium companies (balanced growth and stability)\n- Small companies (more growth potential but higher risk)\n\n### 4. Add international investments\n- U.S. companies\n- Developed international markets (Europe, Japan, etc.)\n- Emerging markets (Brazil, India, etc.)\n\n## Easy ways to diversify\n\n**Index funds and ETFs**: These automatically invest you in hundreds or thousands of companies at once. Examples include:\n- Total stock market funds\n- S&P 500 index funds\n- International stock funds\n- Bond funds\n\n**Target-date funds**: These automatically adjust your diversification based on when you plan to retire.\n\n**Remember:** Diversification doesn't guarantee profits or prevent losses, but it can help reduce your risk and smooth out your investment journey."
    },
    {
      "id": 7,
      "title": "Long-Term vs. Short-Term Investing",
      "summary": "Compare different time horizons and find the right approach for your goals.",
      "prologue": "Long-term investing focuses on fundamentals and compound growth over years, while short-term trading aims to profit from market fluctuations. This guide helps you determine which approach aligns with your financial goals and risk tolerance.",
      "content": "# Long-Term vs. Short-Term Investing\n\n## Understanding time horizons\nYour investing time horizon is how long you plan to keep your money invested before you need it.\n\n## Long-term investing (5+ years)\n\n### Benefits of long-term investing\n- Takes advantage of compound growth\n- Smooths out market ups and downs\n- Requires less constant attention\n- Often has tax advantages\n- Historically more reliable returns\n\n### Best for\n- Retirement savings\n- College funds for young children\n- Building wealth over decades\n\n### Long-term strategies\n- Buy and hold quality investments\n- Focus on companies with strong fundamentals\n- Reinvest dividends automatically\n- Make regular contributions (dollar-cost averaging)\n\n## Short-term investing (Less than 5 years)\n\n### Characteristics of short-term investing\n- More active management\n- Higher potential for quick gains or losses\n- More frequent buying and selling\n- Greater attention to market timing\n\n### Best for\n- Saving for a house down payment in 2-3 years\n- Upcoming education costs\n- Other specific near-term goals\n\n### Short-term approaches\n- More conservative asset mix\n- Greater focus on stability\n- Less emphasis on growth potential\n- More cash and short-term bonds\n\n## Which approach is right for beginners?\n\nMost financial experts recommend that beginners focus primarily on long-term investing because:\n\n1. It's simpler and requires less expertise\n2. It's less stressful and time-consuming\n3. It has historically provided more reliable returns\n4. It allows more time to recover from mistakes\n\n**Remember:** Your time horizon should match your goals. Money you'll need soon should be invested conservatively, while money for distant goals can be invested more aggressively."
    },
    {
      "id": 8,
      "title": "Risk Management Fundamentals",
      "summary": "Essential techniques to protect your capital and optimize returns.",
      "prologue": "Effective risk management involves position sizing, stop-loss orders, and proper asset allocation. This guide covers these techniques and explains how they can help preserve your capital during market downturns.",
      "content": "# Risk Management Fundamentals\n\n## What is risk management?\nRisk management means taking steps to protect your investments from big losses while still allowing for growth. It's about balancing potential rewards with potential risks.\n\n## Why risk management matters\n- Helps preserve your investment capital\n- Prevents emotional decision-making\n- Keeps small losses from becoming big ones\n- Allows you to stay invested for the long term\n\n## Simple risk management techniques for beginners\n\n### 1. Only invest money you can afford to lose\n- Keep 3-6 months of expenses in an emergency fund\n- Don't invest money you'll need within the next few years\n- Pay off high-interest debt before investing\n\n### 2. Diversify your investments\n- Spread your money across different types of investments\n- Don't put more than 5% of your portfolio in any single stock\n- Use index funds to instantly diversify across many companies\n\n### 3. Match investments to your time horizon\n- Longer time horizon = More stocks (higher growth potential)\n- Shorter time horizon = More bonds and cash (more stability)\n\n### 4. Invest regularly over time\n- Use dollar-cost averaging (investing a fixed amount regularly)\n- Helps avoid investing all your money at market peaks\n- Makes it easier to stick with your plan\n\n### 5. Know your risk tolerance\n- Be honest about how much loss you can handle\n- Take a risk tolerance quiz if you're unsure\n- Choose investments that match your comfort level\n\n## Warning signs that you're taking too much risk\n- You can't sleep at night worrying about your investments\n- You check your investment values multiple times a day\n- You'd need to sell if your investments dropped 20%\n- Your investments are more aggressive than your risk tolerance\n\n**Remember:** The goal isn't to avoid risk completely (that's impossible in investing), but to take smart risks that match your goals and comfort level."
    },
    {
      "id": 9,
      "title": "Using News to Inform Trading Decisions",
      "summary": "How to interpret financial news and apply it to your trading strategy.",
      "prologue": "News can significantly impact markets, but knowing which developments matter is key. This guide teaches how to evaluate news sources, understand market sentiment, and determine when news should influence your investment decisions.",
      "content": "# Using News to Inform Trading Decisions\n\n## How news affects the market\nFinancial news can cause stock prices to move up or down quickly as investors react to new information. Understanding how to interpret news can help you make better decisions.\n\n## Types of news that impact investments\n\n### Company news\n- Earnings reports (quarterly financial results)\n- New product announcements\n- Management changes\n- Mergers and acquisitions\n\n### Economic news\n- Interest rate changes\n- Unemployment reports\n- Inflation data\n- GDP growth\n\n### Industry news\n- New regulations\n- Technology breakthroughs\n- Changes in consumer behavior\n- Competition developments\n\n## How to use news as a beginner investor\n\n### 1. Don't react immediately to breaking news\n- Markets often overreact at first\n- Wait for the full story to develop\n- Consider how the news affects long-term value\n\n### 2. Focus on news that affects your investments\n- Pay more attention to news about companies you own\n- Look for how news might impact your specific holdings\n- Ignore most day-to-day market noise\n\n### 3. Use news to spot trends, not time the market\n- Look for bigger patterns across multiple news stories\n- Use news to understand industry direction\n- Don't try to jump in and out based on headlines\n\n### 4. Consider the source\n- Official company statements and SEC filings are most reliable\n- Major financial publications offer good analysis\n- Be cautious of social media investment advice\n\n## When to adjust your investments based on news\n\n- Major changes to a company's business model\n- Significant shifts in industry conditions\n- Changes to your investment timeframe or goals\n- Evidence of serious problems at a company you own\n\n**Remember:** For long-term investors, most daily news shouldn't trigger buying or selling decisions. The most successful investors often make fewer moves based on news, not more."
    },
    {
      "id": 10,
      "title": "Technical Analysis Basics",
      "summary": "Introduction to chart patterns and indicators for market timing.",
      "prologue": "Technical analysis studies price movements and trading volumes to predict future price direction. Learn about support/resistance levels, moving averages, RSI, and other indicators that can help optimize your entry and exit points.",
      "content": "# Technical Analysis Basics\n\n## What is technical analysis?\nTechnical analysis is studying price charts and patterns to make investment decisions. Instead of focusing on a company's business (fundamental analysis), technical analysis looks at price movements and trading volume.\n\n## Key concepts for beginners\n\n### 1. Price charts\nCharts show a stock's price over time. Common chart types:\n- **Line charts**: Simple, showing closing prices\n- **Candlestick charts**: Show opening, closing, high and low prices\n- **Bar charts**: Similar to candlesticks but in a different format\n\n### 2. Support and resistance\n- **Support**: Price level where a stock tends to stop falling\n- **Resistance**: Price level where a stock tends to stop rising\n- When these levels break, prices often move significantly\n\n### 3. Moving averages\nAverages of prices over a specific time period that help identify trends:\n- **50-day moving average**: Shows medium-term trend\n- **200-day moving average**: Shows long-term trend\n- When shorter averages cross above longer ones, it's often bullish\n\n### 4. Volume\nThe number of shares traded in a period:\n- Higher volume with price increases suggests stronger trends\n- Price moves on low volume may be less reliable\n\n### 5. Basic indicators for beginners\n\n- **Relative Strength Index (RSI)**: Measures if a stock might be overbought or oversold\n- **MACD (Moving Average Convergence Divergence)**: Shows momentum changes\n- **Bollinger Bands**: Show when prices might be extreme compared to recent averages\n\n## How to use technical analysis as a beginner\n\n1. **Start simple**: Focus on price trends and moving averages first\n2. **Use multiple indicators**: Don't rely on just one signal\n3. **Combine with fundamental analysis**: Use both approaches for better decisions\n4. **Practice with paper trading**: Try techniques without risking real money\n\n**Remember:** Technical analysis is not perfect. No indicator can predict the future with certainty. Many successful long-term investors focus more on fundamentals than technical indicators."
    }
  ]